In [1]:
import pandas as pd

data analysis
1. description
2. diagnosis
3. prediction
4. actions/prescription

In [2]:
# THE COLUMNS NAME 
cols = ['user_id', 'movie_id', 'rating', 'ts']

In [3]:
# columns name for other file 
item_cols= ['movie_id', 'title'] + [str(i) for i in range(22)]

In [4]:
# READ THE FILE 
df = pd.read_csv(r'u.data', sep='\t' , names = cols)

In [5]:
#Read the other file 
df1 = pd.read_csv(r'u.item', sep= '|', names =item_cols, encoding = "ISO-8859-1")[['movie_id' , 'title']]

# EXPLORATORY DATA ANALYSIS (EDA)

In [8]:
df.sample(5)

       user_id  movie_id  rating         ts
8055       134       300       3  891732220
48841       57       473       3  883697916
88643      573       237       4  885843527
24374      284       748       3  885329671
77243      642       186       5  885602739

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100003 entries, 0 to 100002
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   100003 non-null  int64
 1   movie_id  100003 non-null  int64
 2   rating    100003 non-null  int64
 3   ts        100003 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB

In [10]:
df.describe(include='all')

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

try to find the different data:
1. string with categorical info
2. strings with random stuff
3. number with quanitified info
4. number with categorical info
5. random number or id sort of data

In [11]:
df.columns

Index(['user_id', 'movie_id', 'rating', 'ts'], dtype='object')

In [12]:
df['rating'].unique()

array([5, 1, 3, 2, 4], dtype=int64)

In [13]:
df['rating'].nunique()

5

In [14]:
df['user_id'].nunique()

944

In [15]:
df1.sample(5)

      movie_id                           title
1016      1017             Trees Lounge (1996)
629        630          Great Race, The (1965)
45          46                  Exotica (1994)
644        645         Paris Is Burning (1990)
1088      1089  Speed 2: Cruise Control (1997)

In [16]:
df1.shape

(1682, 2)

In [17]:
a=[1,2,3,4,5]

In [18]:
#b= [2,4,6,8,10]

In [19]:
b=[]
for i in a :
    b.append(i*2)
b

[2, 4, 6, 8, 10]

In [20]:
# compehension process 
b=[i*2 for i in a]
b

[2, 4, 6, 8, 10]

In [21]:
df1.sample(5)

      movie_id                              title
1585      1586              Lashou shentan (1992)
66          67  Ace Ventura: Pet Detective (1994)
853        854                   Bad Taste (1987)
348        349                   Hard Rain (1998)
765        766             Man of the Year (1995)

In [22]:
df.sample(5)

       user_id  movie_id  rating         ts
11405       54       827       3  880937813
35476      222       620       3  877563873
78496      682       228       4  888520923
13817      279        52       3  890780576
49854      655       320       5  888474456

In [6]:
# merging dataframes

In [8]:
movie = pd.merge(df,df1, on= 'movie_id')
movie.head()

   user_id  movie_id  rating         ts             title
0        0        50       5  881250949  Star Wars (1977)
1      290        50       5  880473582  Star Wars (1977)
2       79        50       4  891271545  Star Wars (1977)
3        2        50       5  888552084  Star Wars (1977)
4        8        50       5  879362124  Star Wars (1977)

In [9]:
# remove the rebundant or useless columns 
movie.drop('ts' , axis=1 , inplace = True)

In [10]:
movie.head()

   user_id  movie_id  rating             title
0        0        50       5  Star Wars (1977)
1      290        50       5  Star Wars (1977)
2       79        50       4  Star Wars (1977)
3        2        50       5  Star Wars (1977)
4        8        50       5  Star Wars (1977)

In [11]:
# find the number of ratings for each movie
movie['title'].value_counts().head(10)

Star Wars (1977)                 584
Contact (1997)                   509
Fargo (1996)                     508
Return of the Jedi (1983)        507
Liar Liar (1997)                 485
English Patient, The (1996)      481
Scream (1996)                    478
Toy Story (1995)                 452
Air Force One (1997)             431
Independence Day (ID4) (1996)    429
Name: title, dtype: int64

# find the average rating of each movie

In [12]:
movie.groupby('title')['rating'].mean().sort_values(ascending=False).head(10)

title
They Made Me a Criminal (1939)                       5.0
Marlene Dietrich: Shadow and Light (1996)            5.0
Saint of Fort Washington, The (1993)                 5.0
Someone Else's America (1995)                        5.0
Star Kid (1997)                                      5.0
Great Day in Harlem, A (1994)                        5.0
Aiqing wansui (1994)                                 5.0
Santa with Muscles (1996)                            5.0
Prefontaine (1997)                                   5.0
Entertaining Angels: The Dorothy Day Story (1996)    5.0
Name: rating, dtype: float64

In [13]:
rating= pd.DataFrame(movie.groupby('title')['rating'].mean().sort_values(ascending=False))

In [14]:
rating

                                              rating
title
They Made Me a Criminal (1939)                   5.0
Marlene Dietrich: Shadow and Light (1996)        5.0
Saint of Fort Washington, The (1993)             5.0
Someone Else's America (1995)                    5.0
Star Kid (1997)                                  5.0
...                                              ...
Eye of Vichy, The (Oeil de Vichy, L') (1993)     1.0
King of New York (1990)                          1.0
Touki Bouki (Journey of the Hyena) (1973)        1.0
Bloody Child, The (1996)                         1.0
Crude Oasis, The (1995)                          1.0

[1664 rows x 1 columns]

In [31]:
rating['count']= movie['title'].value_counts()

In [32]:
rating.head(20)

                                                      rating  count
title
They Made Me a Criminal (1939)                      5.000000      1
Marlene Dietrich: Shadow and Light (1996)           5.000000      1
Saint of Fort Washington, The (1993)                5.000000      2
Someone Else's America (1995)                       5.000000      1
Star Kid (1997)                                     5.000000      3
Great Day in Harlem, A (1994)                       5.000000      1
Aiqing wansui (1994)                                5.000000      1
Santa with Muscles (1996)                           5.000000      2
Prefontaine (1997)                                  5.000000      3
Entertaining Angels: The Dorothy Day Story (1996)   5.000000      1
Pather Panchali (1955)                              4.625000      8
Some Mother's Son (1996)                            4.500000      2
Maya Lin: A Strong Clear Vision (1994)              4.500000      4
Anna (1996)                                         4.500000      2
Everest (1998)                                      4.500000      2
Close Shave, A (1995)                               4.491071    112
Schindler's List (1993)                             4.466443    298
Wrong Trousers, The (1993)                          4.466102    118
Casablanca (1942)                                   4.456790    243
Wallace & Gromit: The Best of Aardman Animation...  4.447761     67

In [33]:
rating.sort_values(by='count', ascending=False).head(20)

                                    rating  count
title
Star Wars (1977)                  4.359589    584
Contact (1997)                    3.803536    509
Fargo (1996)                      4.155512    508
Return of the Jedi (1983)         4.007890    507
Liar Liar (1997)                  3.156701    485
English Patient, The (1996)       3.656965    481
Scream (1996)                     3.441423    478
Toy Story (1995)                  3.878319    452
Air Force One (1997)              3.631090    431
Independence Day (ID4) (1996)     3.438228    429
Raiders of the Lost Ark (1981)    4.252381    420
Godfather, The (1972)             4.283293    413
Pulp Fiction (1994)               4.060914    394
Twelve Monkeys (1995)             3.798469    392
Silence of the Lambs, The (1991)  4.289744    390
Jerry Maguire (1996)              3.710938    384
Chasing Amy (1997)                3.839050    379
Rock, The (1996)                  3.693122    378
Empire Strikes Back, The (1980)   4.206522    368
Star Trek: First Contact (1996)   3.660274    365

In [34]:
movie_pivot=movie.pivot_table(index = 'user_id' , columns = 'title' , values = 'rating')
movie_pivot.head()

title,'Til There Was You (1997),1-900 (1994),101 Dalmatians (1996),12 Angry Men (1957),187 (1997),2 Days in the Valley (1996),"20,000 Leagues Under the Sea (1954)",2001: A Space Odyssey (1968),3 Ninjas: High Noon At Mega Mountain (1998),"39 Steps, The (1935)",...,Yankee Zulu (1994),Year of the Horse (1997),You So Crazy (1994),Young Frankenstein (1974),Young Guns (1988),Young Guns II (1990),"Young Poisoner's Handbook, The (1995)",Zeus and Roxanne (1997),unknown,Á köldum klaka (Cold Fever) (1994)
user_id,,,,,,,,,,,,,,,,,,,,,
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,2.0,5.0,NaN,NaN,3.0,4.0,NaN,NaN,...,NaN,NaN,NaN,5.0,3.0,NaN,NaN,NaN,4.0,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [35]:
movie_selected = 'Star Wars (1977)'

In [36]:
ms_rates = movie_pivot[movie_selected]
ms_rates.head()

user_id
0    5.0
1    5.0
2    5.0
3    NaN
4    5.0
Name: Star Wars (1977), dtype: float64

In [37]:
import warnings
warnings.filterwarnings('ignore')

In [38]:
corrs= movie_pivot.corrwith(ms_rates)
corrs.head(20)

title
'Til There Was You (1997)                      0.872872
1-900 (1994)                                  -0.645497
101 Dalmatians (1996)                          0.211132
12 Angry Men (1957)                            0.184289
187 (1997)                                     0.027398
2 Days in the Valley (1996)                    0.066654
20,000 Leagues Under the Sea (1954)            0.289768
2001: A Space Odyssey (1968)                   0.230884
3 Ninjas: High Noon At Mega Mountain (1998)         NaN
39 Steps, The (1935)                           0.106453
8 1/2 (1963)                                  -0.142977
8 Heads in a Duffel Bag (1997)                -0.577350
8 Seconds (1994)                              -0.755929
A Chef in Love (1996)                          0.868599
Above the Rim (1994)                          -0.645497
Absolute Power (1997)                          0.085440
Abyss, The (1989)                              0.203709
Ace Ventura: Pet Detective (1994)              0.062689
Ace Ventura: When Nature Calls (1995)          0.094514
Across the Sea of Time (1995)                 -0.132453
dtype: float64

In [39]:
corrs.sort_values(ascending = False).head(8)

title
Hollow Reed (1996)                                                                   1.0
Stripes (1981)                                                                       1.0
Star Wars (1977)                                                                     1.0
Man of the Year (1995)                                                               1.0
Beans of Egypt, Maine, The (1994)                                                    1.0
Safe Passage (1994)                                                                  1.0
Old Lady Who Walked in the Sea, The (Vieille qui marchait dans la mer, La) (1991)    1.0
Outlaw, The (1943)                                                                   1.0
dtype: float64

In [40]:
corrs_df = pd.DataFrame(corrs , columns = ['correltion'])
corrs_df.head()

                           correltion
title
'Til There Was You (1997)    0.872872
1-900 (1994)                -0.645497
101 Dalmatians (1996)        0.211132
12 Angry Men (1957)          0.184289
187 (1997)                   0.027398

In [41]:
corrs_df['rating'] = rating['rating']
corrs_df['count']= rating['count']

In [42]:
corrs_df.head()

                           correltion    rating  count
title
'Til There Was You (1997)    0.872872  2.333333      9
1-900 (1994)                -0.645497  2.600000      5
101 Dalmatians (1996)        0.211132  2.908257    109
12 Angry Men (1957)          0.184289  4.344000    125
187 (1997)                   0.027398  3.024390     41

In [43]:
top_recom = list(corrs_df[corrs_df['count']>50].sort_values(by='correltion' , ascending = False).head(3).index)

In [44]:
top_recom

['Star Wars (1977)',
 'Empire Strikes Back, The (1980)',
 'Return of the Jedi (1983)']

In [45]:
# for example 
a= [4,5,7]

In [46]:
a.remove(5)

In [47]:
a

[4, 7]

In [48]:
top_recom.remove(movie_selected)

In [49]:
top_recom

['Empire Strikes Back, The (1980)', 'Return of the Jedi (1983)']

In [53]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

def movie_recommend(movie_selected = 'Star Wars (1977)'):
    
    #Read files 
    cols = ['user_id', 'movie_id', 'rating', 'ts']
    df = pd.read_csv(r'u.data', sep='\t' , names = cols).drop('ts' , axis =1)
    item_cols= ['movie_id', 'title'] + [str(i) for i in range(22)]
    df1 = pd.read_csv(r'u.item', sep= '|', names =item_cols, encoding = "ISO-8859-1")[['movie_id' , 'title']]
    
    #Merge the dataframes 
    movie = pd.merge(df,df1, on= 'movie_id')
    
    #create pivot table 
    movie_pivot=movie.pivot_table(index = 'user_id' , columns = 'title' , values = 'rating')
    
    # find similarities for selected movie
    corrs = movie_pivot.corrwith(movie_pivot[movie_selected])
    corrs_df = pd.DataFrame(corrs , columns = ['correltion'])
    corrs_df['rating'] = movie.groupby('title')['rating'].mean()
    corrs_df['count'] = movie['title'].value_counts()
    
    # find top 2-3 recommendation
    top_recom = list(corrs_df[corrs_df['count']>50].sort_values(by='correltion' , ascending = False).head(3).index)
    top_recom.remove(movie_selected)
    
    return top_recom

In [54]:
movie_recommend('Giant (1956)')

['Daylight (1996)', 'Anastasia (1997)']

In [55]:
movie_recommend('Star Wars (1977)')

['Empire Strikes Back, The (1980)', 'Return of the Jedi (1983)']